'''
                    Задача 1
    Даны два неупорядоченных набора целых чисел (может быть, с
повторениями). Выдать без повторений в порядке возрастания все те числа, которые
ВСТРЕЧАЮТСЯ в обоих наборах.
    Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
элементов второго множества. Затем пользователь вводит сами элементы множеств.
    11 6
    2 4 6 8 10 12 10 8 6 4 2
    3 6 9 12 15 18
    6 12
'''
#=================================================================================================================================================
                            # Решение ВЕРНОЕ с подсказкой из автотеста

var1 = '3 6 9 45 15 10 18' # элементы первой строки
var2 = '2 4 6 8 10 45 10 3 8 6 15 4 2 7 9' # элементы второй строки

List_var1 = [int(x) for x in var1.split()]
One_set = set(List_var1)
print('Первый список: ',List_var1)
print('Первое множество: ',One_set)
print()

List_var2 = [int(x) for x in var2.split()]
Two_set = set(List_var2)
print('Второй список: ',List_var2)
print('Второе множество: ',Two_set)
print()

total_m = One_set & Two_set
print('Общее множество: ',total_m)
End_list = list(total_m)
End_list.sort()
print('Крайний список: ',End_list)
print(type(End_list))

for i in End_list: # цикл для преобразования списка в строку
   print(i, end=' ')
# Почему вместо цикла for не удается применить вывод:
# print(' '.join(End_list), end='') #??????????????????????????????????????????????



#=================================================================================================================================================
                            # Проверка работы метода .sort
# #  Проверка метода .sort на списке
# list = [10, 65, 38, 1, 14, 5, 73, 4, 82, 19]
# print(list)  # [10, 65, 38, 1, 14, 5, 73, 4, 82, 19]
# print()
# list.sort()
# print(list)  # [1, 4, 5, 10, 14, 19, 38, 65, 73, 82]
# print(list[0])  # 1

#=================================================================================================================================================
                           # Мой код, отправленный в автотест, НЕ работает с ДВУЗНАЧНЫМИ числами, только с ЦИФРАМИ:
# var2 = '7 1 3 5 9' 
# var3 = '2 3 4 5 7 1' 

# num2 = set(var2.split())
# num3 = set(var3.split())

# Out = ""
# number = ""
# for let2 in num2:
#     for let3 in num3:
#         if let2 == let3:
#             Out += let2 + " "
# number = Out.split()
# number.sort()
# print(' '.join(number), end='')


#=================================================================================================================================================
                            # Очередное мое решение. НЕ РАБОТАЕТ..

# var1 = '3 6 9 45 15 10 18'.split() # элементы первой строки, преобразуем в список
# var2 = '2 4 6 8 10 45 10 3 8 6 15 4 2 7 9'.split() # элементы второй строки, преобразуем в список

# print()
# print("Множество 1: ")
# num1 = set(var1) # set - создает УНИКАЛЬНОЕ множество из перволночального списка
#                 # причем, каждый раз обращаясь к переменной num1, 
#                 # ПОСЛЕДОВАТЕЛЬНОСТЬ элементов первоначального списка изменяется
# print(num1)
# print("Множество 2: ")
# num2 = set(var2)
# print(num2)
# print()

# print("Общие элементы двух множеств: ")
# total_m = num1 & num2
# print(total_m)
# print()

# print("Список: ")
# list = list(total_m)
# print(list)
# print(list[0])
# print(list[1])
# print(list[2])
# print(list[3])
# print(list[4])
# print(list[5])
# print()

# print("Список по возрастанию: ")
# def insertion_sort(list):
#     for i in range(1, len(list)):
#         temp = list[i]
#         j = i-1
#         while j >= 0 and list[j] > temp:
#             list[j+1] = list[j]
#             j -= 1
#         list[j+1] = temp

# insertion_sort(list)
# print(list) #по возрастанию выводит следующий список ['10', '15', '3', '45', '6', '9']


#=================================================================================================================================================
                            # Очередное мое решение 2. НЕ РАБОТАЕТ..
# var1 = '2 4 6 8 10 12 10 8 6 4 2'.split() # элементы первого множества
# var2 = '3 6 9 12 15 18'.split() # элементы второго множества

# # var1 = '10 50 40 30 20'.split() # элементы первого множества
# # var2 = '20 15 30 40 10'.split() # элементы второго множества

# num1 = set(var1) # set - создает УНИКАЛЬНОЕ множество из перволночальной строки
#                 # причем, каждый раз обращаясь к переменной num1, 
#                 # ПОСЛЕДОВАТЕЛЬНОСТЬ элементов первоначального списка изменяется
# print(num1)
# num2 = set(var2)
# print(num2)
# Out = ""
# # number = ""
# for let1 in num1:
#     for let2 in num2:
#         if let2 == let1:
#             Out += let1 + " "
# number = Out.split() # в переменную number записываем сформированный СПИСОК из СТРОКИ Out
# # print(number)
# number.sort()
# print(type(number))
# print(' '.join(number), end='') # 12 6